PayPalAPISoapBinding.SetExpressCheckout.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:SetExpressCheckoutReq>
    <ns1:SetExpressCheckoutRequest>
     <ns3:SetExpressCheckoutRequestDetails>
      <ns3:OrderTotal currencyID="AFA"></ns3:OrderTotal>
      <ns3:ReturnURL></ns3:ReturnURL>
      <ns3:CancelURL></ns3:CancelURL>
      <ns3:TrackingImageURL></ns3:TrackingImageURL>
      <ns3:giropaySuccessURL></ns3:giropaySuccessURL>
      <ns3:giropayCancelURL></ns3:giropayCancelURL>
      <ns3:BanktxnPendingURL></ns3:BanktxnPendingURL>
      <ns3:Token></ns3:Token>
      <ns3:MaxAmount currencyID="AFA"></ns3:MaxAmount>
      <ns3:OrderDescription></ns3:OrderDescription>
      <ns3:Custom></ns3:Custom>
      <ns3:InvoiceID></ns3:InvoiceID>
      <ns3:ReqConfirmShipping></ns3:ReqConfirmShipping>
      <ns3:ReqBillingAddress></ns3:ReqBillingAddress>
      <ns3:BillingAddress>
       <ns3:Name></ns3:Name>
       <ns3:Street1></ns3:Street1>
       <ns3:Street2></ns3:Street2>
       <ns3:CityName></ns3:CityName>
       <ns3:StateOrProvince></ns3:StateOrProvince>
       <ns3:Country>AF</ns3:Country>
       <ns3:CountryName></ns3:CountryName>
       <ns3:Phone></ns3:Phone>
       <ns3:PostalCode></ns3:PostalCode>
       <ns3:AddressID></ns3:AddressID>
       <ns3:AddressOwner>PayPal</ns3:AddressOwner>
       <ns3:ExternalAddressID></ns3:ExternalAddressID>
       <ns3:InternationalName></ns3:InternationalName>
       <ns3:InternationalStateAndCity></ns3:InternationalStateAndCity>
       <ns3:InternationalStreet></ns3:InternationalStreet>
       <ns3:AddressStatus>None</ns3:AddressStatus>
       <ns3:AddressNormalizationStatus>None</ns3:AddressNormalizationStatus>
      </ns3:BillingAddress>
      <ns3:NoShipping></ns3:NoShipping>
      <ns3:AddressOverride></ns3:AddressOverride>
      <ns3:LocaleCode></ns3:LocaleCode>
      <ns3:PageStyle></ns3:PageStyle>
      <ns3:cpp-header-image></ns3:cpp-header-image>
      <ns3:cpp-header-border-color></ns3:cpp-header-border-color>
      <ns3:cpp-header-back-color></ns3:cpp-header-back-color>
      <ns3:cpp-payflow-color></ns3:cpp-payflow-color>
      <ns3:cpp-cart-border-color></ns3:cpp-cart-border-color>
      <ns3:cpp-logo-image></ns3:cpp-logo-image>
      <ns3:Address>
       <ns3:Name></ns3:Name>
       <ns3:Street1></ns3:Street1>
       <ns3:Street2></ns3:Street2>
       <ns3:CityName></ns3:CityName>
       <ns3:StateOrProvince></ns3:StateOrProvince>
       <ns3:Country>AF</ns3:Country>
       <ns3:CountryName></ns3:CountryName>
       <ns3:Phone></ns3:Phone>
       <ns3:PostalCode></ns3:PostalCode>
       <ns3:AddressID></ns3:AddressID>
       <ns3:AddressOwner>PayPal</ns3:AddressOwner>
       <ns3:ExternalAddressID></ns3:ExternalAddressID>
       <ns3:InternationalName></ns3:InternationalName>
       <ns3:InternationalStateAndCity></ns3:InternationalStateAndCity>
       <ns3:InternationalStreet></ns3:InternationalStreet>
       <ns3:AddressStatus>None</ns3:AddressStatus>
       <ns3:AddressNormalizationStatus>None</ns3:AddressNormalizationStatus>
      </ns3:Address>
      <ns3:PaymentAction>None</ns3:PaymentAction>
      <ns3:SolutionType>Mark</ns3:SolutionType>
      <ns3:LandingPage>None</ns3:LandingPage>
      <ns3:BuyerEmail></ns3:BuyerEmail>
      <ns3:ChannelType>Merchant</ns3:ChannelType>
      <ns3:BillingAgreementDetails>
       <ns3:BillingType>None</ns3:BillingType>
       <ns3:BillingAgreementDescription></ns3:BillingAgreementDescription>
       <ns3:PaymentType>Any</ns3:PaymentType>
       <ns3:BillingAgreementCustom></ns3:BillingAgreementCustom>
      </ns3:BillingAgreementDetails>
      <ns3:BillingAgreementDetails>
       <ns3:BillingType>None</ns3:BillingType>
       <ns3:BillingAgreementDescription></ns3:BillingAgreementDescription>
       <ns3:PaymentType>Any</ns3:PaymentType>
       <ns3:BillingAgreementCustom></ns3:BillingAgreementCustom>
      </ns3:BillingAgreementDetails>
      <ns3:PromoCodes></ns3:PromoCodes>
      <ns3:PromoCodes></ns3:PromoCodes>
      <ns3:PayPalCheckOutBtnType></ns3:PayPalCheckOutBtnType>
      <ns3:ProductCategory>Other</ns3:ProductCategory>
      <ns3:ShippingMethod>UPSGround</ns3:ShippingMethod>
      <ns3:ProfileAddressChangeDate>2017-10-31T23:22:27Z</ns3:ProfileAddressChangeDate>
      <ns3:AllowNote></ns3:AllowNote>
      <ns3:FundingSourceDetails>
       <ns3:AllowPushFunding></ns3:AllowPushFunding>
       <ns3:UserSelectedFundingSource>ELV</ns3:UserSelectedFundingSource>
      </ns3:FundingSourceDetails>
      <ns3:BrandName></ns3:BrandName>
      <ns3:CallbackURL></ns3:CallbackURL>
      <ns3:EnhancedCheckoutData>
      </ns3:EnhancedCheckoutData>
      <ns3:OtherPaymentMethods>
       <ns3:OtherPaymentMethodId></ns3:OtherPaymentMethodId>
       <ns3:OtherPaymentMethodType></ns3:OtherPaymentMethodType>
       <ns3:OtherPaymentMethodLabel></ns3:OtherPaymentMethodLabel>
       <ns3:OtherPaymentMethodLabelDescription></ns3:OtherPaymentMethodLabelDescription>
       <ns3:OtherPaymentMethodLongDescriptionTitle></ns3:OtherPaymentMethodLongDescriptionTitle>
       <ns3:OtherPaymentMethodLongDescription></ns3:OtherPaymentMethodLongDescription>
       <ns3:OtherPaymentMethodIcon></ns3:OtherPaymentMethodIcon>
       <ns3:OtherPaymentMethodHideLabel>false</ns3:OtherPaymentMethodHideLabel>
      </ns3:OtherPaymentMethods>
      <ns3:OtherPaymentMethods>
       <ns3:OtherPaymentMethodId></ns3:OtherPaymentMethodId>
       <ns3:OtherPaymentMethodType></ns3:OtherPaymentMethodType>
       <ns3:OtherPaymentMethodLabel></ns3:OtherPaymentMethodLabel>
       <ns3:OtherPaymentMethodLabelDescription></ns3:OtherPaymentMethodLabelDescription>
       <ns3:OtherPaymentMethodLongDescriptionTitle></ns3:OtherPaymentMethodLongDescriptionTitle>
       <ns3:OtherPaymentMethodLongDescription></ns3:OtherPaymentMethodLongDescription>
       <ns3:OtherPaymentMethodIcon></ns3:OtherPaymentMethodIcon>
       <ns3:OtherPaymentMethodHideLabel>false</ns3:OtherPaymentMethodHideLabel>
      </ns3:OtherPaymentMethods>
      <ns3:BuyerDetails>
       <ns3:BuyerId></ns3:BuyerId>
       <ns3:BuyerUserName></ns3:BuyerUserName>
       <ns3:BuyerRegistrationDate>2017-10-31T23:22:27Z</ns3:BuyerRegistrationDate>
       <ns3:TaxIdDetails>
       </ns3:TaxIdDetails>
       <ns3:IdentificationInfo>
       </ns3:IdentificationInfo>
      </ns3:BuyerDetails>
      <ns3:PaymentDetails>
       <ns3:OrderTotal currencyID="AFA"></ns3:OrderTotal>
       <ns3:ItemTotal currencyID="AFA"></ns3:ItemTotal>
       <ns3:ShippingTotal currencyID="AFA"></ns3:ShippingTotal>
       <ns3:HandlingTotal currencyID="AFA"></ns3:HandlingTotal>
       <ns3:TaxTotal currencyID="AFA"></ns3:TaxTotal>
       <ns3:OrderDescription></ns3:OrderDescription>
       <ns3:Custom></ns3:Custom>
       <ns3:InvoiceID></ns3:InvoiceID>
       <ns3:ButtonSource></ns3:ButtonSource>
       <ns3:NotifyURL></ns3:NotifyURL>
       <ns3:ShipToAddress>
       </ns3:ShipToAddress>
       <ns3:MultiShipping></ns3:MultiShipping>
       <ns3:FulfillmentReferenceNumber></ns3:FulfillmentReferenceNumber>
       <ns3:FulfillmentAddress>
       </ns3:FulfillmentAddress>
       <ns3:PaymentCategoryType>InternationalShipping</ns3:PaymentCategoryType>
       <ns3:LocationType>Consumer</ns3:LocationType>
       <ns3:ShippingMethod>UPSGround</ns3:ShippingMethod>
       <ns3:ProfileAddressChangeDate>2017-10-31T23:22:27Z</ns3:ProfileAddressChangeDate>
       <ns3:PaymentDetailsItem>
       </ns3:PaymentDetailsItem>
       <ns3:PaymentDetailsItem>
       </ns3:PaymentDetailsItem>
       <ns3:InsuranceTotal currencyID="AFA"></ns3:InsuranceTotal>
       <ns3:ShippingDiscount currencyID="AFA"></ns3:ShippingDiscount>
       <ns3:InsuranceOptionOffered></ns3:InsuranceOptionOffered>
       <ns3:AllowedPaymentMethod>Default</ns3:AllowedPaymentMethod>
       <ns3:EnhancedPaymentData>
       </ns3:EnhancedPaymentData>
       <ns3:SellerDetails>
       </ns3:SellerDetails>
       <ns3:NoteText></ns3:NoteText>
       <ns3:TransactionId></ns3:TransactionId>
       <ns3:PaymentAction>None</ns3:PaymentAction>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
       <ns3:OrderURL></ns3:OrderURL>
       <ns3:SoftDescriptor></ns3:SoftDescriptor>
       <ns3:BranchLevel>0</ns3:BranchLevel>
       <ns3:OfferDetails>
       </ns3:OfferDetails>
       <ns3:Recurring>Y</ns3:Recurring>
       <ns3:PaymentReason>None</ns3:PaymentReason>
       <ns3:LocationID></ns3:LocationID>
       <ns3:RedeemedOffers>
       </ns3:RedeemedOffers>
       <ns3:RedeemedOffers>
       </ns3:RedeemedOffers>
       <ns3:CummulativePoints>
       </ns3:CummulativePoints>
       <ns3:CummulativePoints>
       </ns3:CummulativePoints>
       <ns3:MerchantData>
       </ns3:MerchantData>
       <ns3:MerchantData>
       </ns3:MerchantData>
      </ns3:PaymentDetails>
      <ns3:PaymentDetails>
       <ns3:OrderTotal currencyID="AFA"></ns3:OrderTotal>
       <ns3:ItemTotal currencyID="AFA"></ns3:ItemTotal>
       <ns3:ShippingTotal currencyID="AFA"></ns3:ShippingTotal>
       <ns3:HandlingTotal currencyID="AFA"></ns3:HandlingTotal>
       <ns3:TaxTotal currencyID="AFA"></ns3:TaxTotal>
       <ns3:OrderDescription></ns3:OrderDescription>
       <ns3:Custom></ns3:Custom>
       <ns3:InvoiceID></ns3:InvoiceID>
       <ns3:ButtonSource></ns3:ButtonSource>
       <ns3:NotifyURL></ns3:NotifyURL>
       <ns3:ShipToAddress>
       </ns3:ShipToAddress>
       <ns3:MultiShipping></ns3:MultiShipping>
       <ns3:FulfillmentReferenceNumber></ns3:FulfillmentReferenceNumber>
       <ns3:FulfillmentAddress>
       </ns3:FulfillmentAddress>
       <ns3:PaymentCategoryType>InternationalShipping</ns3:PaymentCategoryType>
       <ns3:LocationType>Consumer</ns3:LocationType>
       <ns3:ShippingMethod>UPSGround</ns3:ShippingMethod>
       <ns3:ProfileAddressChangeDate>2017-10-31T23:22:27Z</ns3:ProfileAddressChangeDate>
       <ns3:PaymentDetailsItem>
       </ns3:PaymentDetailsItem>
       <ns3:PaymentDetailsItem>
       </ns3:PaymentDetailsItem>
       <ns3:InsuranceTotal currencyID="AFA"></ns3:InsuranceTotal>
       <ns3:ShippingDiscount currencyID="AFA"></ns3:ShippingDiscount>
       <ns3:InsuranceOptionOffered></ns3:InsuranceOptionOffered>
       <ns3:AllowedPaymentMethod>Default</ns3:AllowedPaymentMethod>
       <ns3:EnhancedPaymentData>
       </ns3:EnhancedPaymentData>
       <ns3:SellerDetails>
       </ns3:SellerDetails>
       <ns3:NoteText></ns3:NoteText>
       <ns3:TransactionId></ns3:TransactionId>
       <ns3:PaymentAction>None</ns3:PaymentAction>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
       <ns3:OrderURL></ns3:OrderURL>
       <ns3:SoftDescriptor></ns3:SoftDescriptor>
       <ns3:BranchLevel>0</ns3:BranchLevel>
       <ns3:OfferDetails>
       </ns3:OfferDetails>
       <ns3:Recurring>Y</ns3:Recurring>
       <ns3:PaymentReason>None</ns3:PaymentReason>
       <ns3:LocationID></ns3:LocationID>
       <ns3:RedeemedOffers>
       </ns3:RedeemedOffers>
       <ns3:RedeemedOffers>
       </ns3:RedeemedOffers>
       <ns3:CummulativePoints>
       </ns3:CummulativePoints>
       <ns3:CummulativePoints>
       </ns3:CummulativePoints>
       <ns3:MerchantData>
       </ns3:MerchantData>
       <ns3:MerchantData>
       </ns3:MerchantData>
      </ns3:PaymentDetails>
      <ns3:FlatRateShippingOptions>
       <ns3:ShippingOptionIsDefault></ns3:ShippingOptionIsDefault>
       <ns3:ShippingOptionAmount currencyID="AFA"></ns3:ShippingOptionAmount>
       <ns3:ShippingOptionName></ns3:ShippingOptionName>
      </ns3:FlatRateShippingOptions>
      <ns3:FlatRateShippingOptions>
       <ns3:ShippingOptionIsDefault></ns3:ShippingOptionIsDefault>
       <ns3:ShippingOptionAmount currencyID="AFA"></ns3:ShippingOptionAmount>
       <ns3:ShippingOptionName></ns3:ShippingOptionName>
      </ns3:FlatRateShippingOptions>
      <ns3:CallbackTimeout></ns3:CallbackTimeout>
      <ns3:CallbackVersion></ns3:CallbackVersion>
      <ns3:CustomerServiceNumber></ns3:CustomerServiceNumber>
      <ns3:GiftMessageEnable></ns3:GiftMessageEnable>
      <ns3:GiftReceiptEnable></ns3:GiftReceiptEnable>
      <ns3:GiftWrapEnable></ns3:GiftWrapEnable>
      <ns3:GiftWrapName></ns3:GiftWrapName>
      <ns3:GiftWrapAmount currencyID="AFA"></ns3:GiftWrapAmount>
      <ns3:BuyerEmailOptInEnable></ns3:BuyerEmailOptInEnable>
      <ns3:SurveyEnable></ns3:SurveyEnable>
      <ns3:SurveyQuestion></ns3:SurveyQuestion>
      <ns3:SurveyChoice></ns3:SurveyChoice>
      <ns3:SurveyChoice></ns3:SurveyChoice>
      <ns3:TotalType>Total</ns3:TotalType>
      <ns3:NoteToBuyer></ns3:NoteToBuyer>
      <ns3:Incentives>
       <ns3:IncentiveCode></ns3:IncentiveCode>
       <ns3:ApplyIndication>
       </ns3:ApplyIndication>
       <ns3:ApplyIndication>
       </ns3:ApplyIndication>
      </ns3:Incentives>
      <ns3:Incentives>
       <ns3:IncentiveCode></ns3:IncentiveCode>
       <ns3:ApplyIndication>
       </ns3:ApplyIndication>
       <ns3:ApplyIndication>
       </ns3:ApplyIndication>
      </ns3:Incentives>
      <ns3:ReqInstrumentDetails></ns3:ReqInstrumentDetails>
      <ns3:ExternalRememberMeOptInDetails>
       <ns3:ExternalRememberMeOptIn></ns3:ExternalRememberMeOptIn>
       <ns3:ExternalRememberMeOwnerDetails>
       </ns3:ExternalRememberMeOwnerDetails>
      </ns3:ExternalRememberMeOptInDetails>
      <ns3:FlowControlDetails>
       <ns3:ErrorURL></ns3:ErrorURL>
       <ns3:InContextReturnURL></ns3:InContextReturnURL>
      </ns3:FlowControlDetails>
      <ns3:DisplayControlDetails>
       <ns3:InContextPaymentButtonImage></ns3:InContextPaymentButtonImage>
      </ns3:DisplayControlDetails>
      <ns3:ExternalPartnerTrackingDetails>
       <ns3:ExternalPartnerSegmentID></ns3:ExternalPartnerSegmentID>
      </ns3:ExternalPartnerTrackingDetails>
      <ns3:CoupledBuckets>
       <ns3:CoupleType>LifeTime</ns3:CoupleType>
       <ns3:CoupledPaymentRequestID></ns3:CoupledPaymentRequestID>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
      </ns3:CoupledBuckets>
      <ns3:CoupledBuckets>
       <ns3:CoupleType>LifeTime</ns3:CoupleType>
       <ns3:CoupledPaymentRequestID></ns3:CoupledPaymentRequestID>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
      </ns3:CoupledBuckets>
     </ns3:SetExpressCheckoutRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:SetExpressCheckoutRequest>
   </ns1:SetExpressCheckoutReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
